app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("salt", "grade", "created_at", "updated_at", "username", "hashed_password", "score", "email") VALUES(E'3516520800.575861605400068', NULL, '2009-03-17 03:47:23.983168', '2009-03-17 03:47:23.983168', E'123', E'92c8f98120b4976f42cefb4b16e4ee99a6dd2156', NULL, E'123@123.com') RETURNING "id"